<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","label":"tts-10x-atj-staging","backend":"599d264ab728bc55f12418ef7b19d6976ac3a92c3a255d6bd9d24fe6dcbea98c","plan_job_ref":"Job Post Terraform plan to PR comment #57 at https://github.com/GSA-TTS/atj-platform/actions/runs/9746848909","plan_out_hash":"ba86ac9669f4d5e0f86ece6ae7b6b584ada288722e154dc73ce6118db321109e","plan_hash":"387519ab47a34b8c6fd4425d782a60ef38ea1c464e83ffac417475e0776191de","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan for __tts-10x-atj-staging__
<details>
<summary>Plan: 4 to add, 0 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # cloudfoundry_app.tts-10x-atj-staging-doj-demo_tts-10x-atj-staging-doj-demo-app_736F8430 will be destroyed
  # (because cloudfoundry_app.tts-10x-atj-staging-doj-demo_tts-10x-atj-staging-doj-demo-app_736F8430 is not in configuration)
-   resource "cloudfoundry_app" "tts-10x-atj-staging-doj-demo_tts-10x-atj-staging-doj-demo-app_736F8430" {
-       disk_quota                      = 4096 -> null
-       docker_image                    = "ghcr.io/gsa-tts/atj-platform/doj-demo:main" -> null
-       enable_ssh                      = true -> null
-       environment                     = (sensitive value) -> null
-       health_check_http_endpoint      = "/" -> null
-       health_check_invocation_timeout = 0 -> null
-       health_check_timeout            = 0 -> null
-       health_check_type               = "http" -> null
-       id                              = "828eaa40-786a-45ce-9a44-3271b1e659d5" -> null
-       id_bg                           = "828eaa40-786a-45ce-9a44-3271b1e659d5" -> null
-       instances                       = 1 -> null
-       labels                          = {} -> null
-       memory                          = 1024 -> null
-       name                            = "tts-10x-atj-staging-doj-demo-app" -> null
-       ports                           = [] -> null
-       space                           = "132fc49b-e29e-40b3-8914-4233e4d4caf4" -> null
-       stopped                         = false -> null
-       strategy                        = "none" -> null
-       timeout                         = 60 -> null
#        (1 unchanged attribute hidden)

-       routes {
-           port  = 0 -> null
-           route = "90846ea2-699e-4416-9037-2c3b739adc90" -> null
        }
    }

  # cloudfoundry_app.tts-10x-atj-staging-server-doj_tts-10x-atj-staging-server-doj-app_E0D2137F will be created
+   resource "cloudfoundry_app" "tts-10x-atj-staging-server-doj_tts-10x-atj-staging-server-doj-app_E0D2137F" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/atj-platform/server-doj:staging"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-atj-staging-server-doj-app"
+       ports                           = (known after apply)
+       space                           = "132fc49b-e29e-40b3-8914-4233e4d4caf4"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 60

+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }
    }

  # cloudfoundry_app.tts-10x-atj-staging-server-kansas_tts-10x-atj-staging-server-kansas-app_0CAEC23C will be created
+   resource "cloudfoundry_app" "tts-10x-atj-staging-server-kansas_tts-10x-atj-staging-server-kansas-app_0CAEC23C" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/atj-platform/server-kansas:staging"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-atj-staging-server-kansas-app"
+       ports                           = (known after apply)
+       space                           = "132fc49b-e29e-40b3-8914-4233e4d4caf4"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 60

+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }
    }

  # cloudfoundry_route.tts-10x-atj-staging-doj-demo-route will be destroyed
  # (because cloudfoundry_route.tts-10x-atj-staging-doj-demo-route is not in configuration)
-   resource "cloudfoundry_route" "tts-10x-atj-staging-doj-demo-route" {
-       domain   = "50ba3f69-cd54-4963-9172-14f3334b479e" -> null
-       endpoint = "tts-10x-atj-staging-doj-demo.app.cloud.gov" -> null
-       hostname = "tts-10x-atj-staging-doj-demo" -> null
-       id       = "90846ea2-699e-4416-9037-2c3b739adc90" -> null
-       space    = "132fc49b-e29e-40b3-8914-4233e4d4caf4" -> null
#        (1 unchanged attribute hidden)
    }

  # cloudfoundry_route.tts-10x-atj-staging-server-doj-route will be created
+   resource "cloudfoundry_route" "tts-10x-atj-staging-server-doj-route" {
+       domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
+       endpoint = (known after apply)
+       hostname = "tts-10x-atj-staging-server-doj"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = "132fc49b-e29e-40b3-8914-4233e4d4caf4"
    }

  # cloudfoundry_route.tts-10x-atj-staging-server-kansas-route will be created
+   resource "cloudfoundry_route" "tts-10x-atj-staging-server-kansas-route" {
+       domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
+       endpoint = (known after apply)
+       hostname = "tts-10x-atj-staging-server-kansas"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = "132fc49b-e29e-40b3-8914-4233e4d4caf4"
    }

Plan: 4 to add, 0 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Post Terraform plan to PR comment #57](https://github.com/GSA-TTS/atj-platform/actions/runs/9746848909)